package day08;

/**
 * Package: day08
 * Author : Wu Wentong
 * Date   : 2021/4/19 下午9:35
 * Project: JavaLearning
 *
 * 一、Java面向对象学习的三条主线
 * 1、Java类及类的成员：属性、方法、构造器；代码块、内部类
 * 2、面向对象的三大特征：封装性、继承性、多态性、（抽象性）
 * 3、其他关键字：this、super、static、final、abstract、interface、package、import等
 *
 * 二、"人把大象装进冰箱"
 * 1、面向过程：强调的是功能行为，以函数为最小单位，考虑怎么做。
 *   a、把冰箱门打开
 *   b、抬大象进去
 *   c、把冰箱关闭
 * 2、面向对象：强调具备了功能的对象，以类、对象为最小单位，考虑谁来做。
 *  人{
 *      打开（冰箱）{
 *          冰箱.开开（）；
 *      }
 *
 *      抬起（大象）{
 *          大象.进入（冰箱）；
 *      }
 *
 *      关闭（冰箱）{
 *          冰箱.闭合();
 *      }
 *  }
 *
 *  冰箱
 *  {
 *      开开（）{}
 *      闭合（）{}
 *  }
 *
 *  大象{
 *      进入（冰箱）{
 *
 *      }
 *  }
 *
 *
 * 三、面向对象的两个要素：
 * 类：对一类事物的描述，是抽象的
 * 对象：是实际存在的该类事物的每个个体，因而也称为实例（instance）
 *
 */


public class OOPTest {
}
